benchmark/uniboost_tail/results/Mon Apr 27 02:11:44 UTC 2026/summary_fcfs_qps8.txt
Skipping import of cpp extensions due to incompatible torch version. Please upgrade to torch >= 2.11.0 (found 2.9.1+cu128).
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=60, dataset_name='custom', dataset_path='/home/azrsadmin/sglang/benchmark/uniboost_tail/mix.jsonl', model='meta-llama/Meta-Llama-3-8B-Instruct', served_model_name=None, tokenizer=None, num_prompts=1000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=8.0, use_trace_timestamps=False, max_concurrency=None, output_file='/home/azrsadmin/sglang/benchmark/uniboost_tail/results/Mon Apr 27 02:11:44 UTC 2026/bench_fcfs_qps8.jsonl', output_details=True, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=20, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=60, dataset_name='custom', dataset_path='/home/azrsadmin/sglang/benchmark/uniboost_tail/mix.jsonl', model='meta-llama/Meta-Llama-3-8B-Instruct', served_model_name=None, tokenizer=None, num_prompts=1000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=8.0, use_trace_timestamps=False, max_concurrency=None, output_file='/home/azrsadmin/sglang/benchmark/uniboost_tail/results/Mon Apr 27 02:11:44 UTC 2026/bench_fcfs_qps8.jsonl', output_details=True, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=20, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 182784
#Output tokens: 320160
Starting warmup with 20 sequences...
Warmup completed with 20 sequences. Starting main benchmark run...
100%|██████████| 1000/1000 [02:51<00:00,  5.84it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    8.0       
Max request concurrency:                 not set   
Successful requests:                     1000      
Benchmark duration (s):                  171.32    
Total input tokens:                      182784    
Total input text tokens:                 182784    
Total generated tokens:                  320160    
Total generated tokens (retokenized):    319961    
Request throughput (req/s):              5.84      
Input token throughput (tok/s):          1066.91   
Output token throughput (tok/s):         1868.78   
Peak output token throughput (tok/s):    2362.00   
Peak concurrent requests:                255       
Total token throughput (tok/s):          2935.69   
Concurrency:                             123.04    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   21079.88  
Median E2E Latency (ms):                 21151.09  
P90 E2E Latency (ms):                    36340.59  
P99 E2E Latency (ms):                    45678.55  
---------------Time to First Token----------------
Mean TTFT (ms):                          15950.90  
Median TTFT (ms):                        15179.85  
P99 TTFT (ms):                           35616.38  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          16.34     
Median TPOT (ms):                        16.02     
P99 TPOT (ms):                           25.40     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           16.07     
Median ITL (ms):                         14.05     
P95 ITL (ms):                            23.15     
P99 ITL (ms):                            40.48     
Max ITL (ms):                            507.31    
==================================================